#define endll endl << endl

#include <iostream>
#include <fstream>

using std::ifstream;
using std::endl;
using std::cout;
using std::cin;

void show(char*);
void error(char*);

char triangle_program(int);
char segment_program(int);
char vector_program(int);
char point_program(int);
char line_program(int);

void file() {
	ifstream file("input.txt");
	if (!file)
		error("Файлът \"input.txt\" не бе открит");
	double line;
	int a, b, i = 0;
	while (file >> line) {
		if (i == 0) {
			a = line;
			i++;
		} else {
			b = line;
			switch (a) {
				case 1:
					point_program(b);
					break;
				case 2:
					vector_program(b);
					break;
				case 3:
					line_program(b);
					break;
				case 4:
					segment_program(b);
					break;
				case 5:
					triangle_program(b);
					break;
			}
		}	
	}
}

int menu(char* menu) {
	unsigned short userInput = 0;
	show(menu);
	cin >> userInput;
	cout << endl;	
	return userInput;
}

void show(char* menu) {
	if (menu == "main")
		cout << endl << " Моля, изберете вид геометричен обект:" << endl
		<< " -------------------------------------" << endl
		<< " 1 - Точка" << endl
		<< " 2 - Вектор" << endl
		<< " 3 - Линия" << endl
		<< " 4 - Отсечка" << endl
		<< " 5 - Триъгълник" << endl
		<< " 6 - Изчистване на конзолата" << endl
		<< " 7 - Прочитане на файл с операции" << endl
		<< " 0 - ИЗХОД" << endll
		<< " Вашият избор: ";
	else if (menu == "line")
		cout << " Моля, изберете операция за обекта:" << endl
		<< " ----------------------------------" << endl
		<< " 1 - намиране на посока на права" << endl
		<< " 2 - намиране на нормален вектор на права" << endl
		<< " 3 - намиране на ъгъл между две прави" << endl
		<< " 4 - проверка дали дадена точка лежи на дадена права" << endl
		<< " 5 - проверка дали дадена права е успоредна на друга права" << endl
		<< " 6 - проверка дали дадена права съвпада с друга права" << endl
		<< " 7 - проверка дали дадена права пресича друга права" << endl
		<< " 8 - проверка дали дадена права е кръстосана с друга права" << endl
		<< " 9 - проверка дали дадена права е перпендикулярна на друга права" << endl
		<< " 0 - ИЗХОД" << endll
		<< " Вашият избор: ";
	else if (menu == "point")
		cout << " Моля, изберете операция за обекта:" << endl
		<< " ----------------------------------" << endl
		<< " 1 - проверка дали дадена точка съвпада с друга точка" << endl
		<< " 0 - ИЗХОД" << endll
		<< " Вашият избор: ";
	else if (menu == "vector")
		cout << " Моля, изберете операция за обекта:" << endl
		<< " ----------------------------------" << endl
		<< " 1 - изчисляване на дължина на вектор" << endl
		<< " 2 - изчисляване на посока на вектор" << endl
		<< " 3 - проекция на вектор върху друг вектор" << endl
		<< " 4 - проверка за нулев вектор" << endl
		<< " 5 - проверка за успоредност на два вектора" << endl
		<< " 6 - проверка за перпендикулярност на два вектора" << endl
		<< " 7 - събиране на два вектора" << endl
		<< " 8 - разлика на два вектора" << endl
		<< " 9 - умножение на вектор с реално число" << endl
		<< " 10 - скаларно произведение на два вектора" << endl
		<< " 11 - векторно произведение на два вектора" << endl
		<< " 12 - смесено произведение на три вектора" << endl
		<< " 0 - ИЗХОД" << endll
		<< " Вашият избор: ";
	else if (menu == "segment")
		cout << " Моля, изберете операция за обекта:" << endl
		<< " ----------------------------------" << endl
		<< " 1 - намиране на дължина на отсечка" << endl
		<< " 2 - намиране на среда на отсечка" << endl
		<< " 3 - проверка дали дадена точка лежи на дадена отсечка" << endl
		<< " 0 - ИЗХОД" << endll
		<< " Вашият избор: ";
	else if (menu == "triangle")
		cout << " Моля, изберете операция за обекта:" << endl
		<< " ----------------------------------" << endl
		<< " 1 - определяне на вида на даден триъгълник" << endl
		<< " 2 - намиране на лицето на даден триъгълник" << endl
		<< " 3 - намиране на периметъра на даден триъгълник" << endl
		<< " 4 - намиране на медицентъра на даден триъгълник" << endl
		<< " 0 - ИЗХОД" << endll
		<< " Вашият избор: ";
	else
		error("Обектът не е разпознат");
}
